; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	image1 - mode
	image2 - mode
	thermograph0 - mode
	thermograph4 - mode
	image3 - mode
	Star1 - direction
	Star3 - direction
	Star4 - direction
	GroundStation0 - direction
	GroundStation2 - direction
	Star5 - direction
	Planet6 - direction
	Star7 - direction
	Planet8 - direction
	Planet9 - direction
	Planet10 - direction
	Phenomenon11 - direction
)
(:init
	(supports instrument0 image2)
	(supports instrument0 thermograph4)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation2)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 image1)
	(supports instrument1 image3)
	(calibration_target instrument1 Star5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star5)
)
(:goal (and
	(pointing satellite0 Phenomenon11)
	(have_image Planet6 thermograph0)
	(have_image Star7 image2)
	(have_image Planet8 image2)
	(have_image Planet9 thermograph0)
	(have_image Planet10 thermograph4)
	(have_image Phenomenon11 image2)
))

)

; plan
1. (turn_to satellite0 groundstation0 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 groundstation0)
   goals met: 0 of 7
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 7
3. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 0 of 7
4. (turn_to satellite0 planet9 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 planet9)
   goals met: 0 of 7
5. (take_image satellite0 planet9 instrument0 thermograph0)
   added: (have_image planet9 thermograph0)
   goals met: 1 of 7
6. (turn_to satellite0 planet8 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 planet8)
   goals met: 1 of 7
7. (take_image satellite0 planet8 instrument0 image2)
   added: (have_image planet8 image2)
   goals met: 2 of 7
8. (turn_to satellite0 planet6 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 planet6)
   goals met: 2 of 7
9. (take_image satellite0 planet6 instrument0 thermograph0)
   added: (have_image planet6 thermograph0)
   goals met: 3 of 7
10. (turn_to satellite0 planet10 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 planet10)
   goals met: 3 of 7
11. (take_image satellite0 planet10 instrument0 thermograph4)
   added: (have_image planet10 thermograph4)
   goals met: 4 of 7
12. (turn_to satellite0 star7 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 star7)
   goals met: 4 of 7
13. (take_image satellite0 star7 instrument0 image2)
   added: (have_image star7 image2)
   goals met: 5 of 7
14. (turn_to satellite0 phenomenon11 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 phenomenon11)
   goals met: 6 of 7
15. (take_image satellite0 phenomenon11 instrument0 image2)
   added: (have_image phenomenon11 image2)
   goals met: 7 of 7
